docs: update architecture diagrams to use mermaid
